MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4450/mcu.h
extern volatile __bit                   EP2CONDIS           __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 EP2CONDIS_bit       _BIT_ACCESS(UEP2,3)
// UEP2<EP2HSHK>
extern volatile __bit                   EP2HSHK             __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 EP2HSHK_bit         _BIT_ACCESS(UEP2,4)
// UEP2<EP2INEN>
extern volatile __bit                   EP2INEN             __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 EP2INEN_bit         _BIT_ACCESS(UEP2,1)
// UEP2<EP2OUTEN>
extern volatile __bit                   EP2OUTEN            __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 EP2OUTEN_bit        _BIT_ACCESS(UEP2,2)
// UEP2<EP2STALL>
extern volatile __bit                   EP2STALL            __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 EP2STALL_bit        _BIT_ACCESS(UEP2,0)
// UEP3<EP3CONDIS>
extern volatile __bit                   EP3CONDIS           __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 EP3CONDIS_bit       _BIT_ACCESS(UEP3,3)
// UEP3<EP3HSHK>
extern volatile __bit                   EP3HSHK             __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 EP3HSHK_bit         _BIT_ACCESS(UEP3,4)
// UEP3<EP3INEN>
extern volatile __bit                   EP3INEN             __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 EP3INEN_bit         _BIT_ACCESS(UEP3,1)
// UEP3<EP3OUTEN>
extern volatile __bit                   EP3OUTEN            __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 EP3OUTEN_bit        _BIT_ACCESS(UEP3,2)
// UEP3<EP3STALL>
extern volatile __bit                   EP3STALL            __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 EP3STALL_bit        _BIT_ACCESS(UEP3,0)
// UEP4<EP4CONDIS>
extern volatile __bit                   EP4CONDIS           __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 EP4CONDIS_bit       _BIT_ACCESS(UEP4,3)
// UEP4<EP4HSHK>
extern volatile __bit                   EP4HSHK             __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 EP4HSHK_bit         _BIT_ACCESS(UEP4,4)
// UEP4<EP4INEN>
extern volatile __bit                   EP4INEN             __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 EP4INEN_bit         _BIT_ACCESS(UEP4,1)
// UEP4<EP4OUTEN>
extern volatile __bit                   EP4OUTEN            __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 EP4OUTEN_bit        _BIT_ACCESS(UEP4,2)
// UEP4<EP4STALL>
extern volatile __bit                   EP4STALL            __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 EP4STALL_bit        _BIT_ACCESS(UEP4,0)
// UEP5<EP5CONDIS>
extern volatile __bit                   EP5CONDIS           __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 EP5CONDIS_bit       _BIT_ACCESS(UEP5,3)
// UEP5<EP5HSHK>
extern volatile __bit                   EP5HSHK             __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 EP5HSHK_bit         _BIT_ACCESS(UEP5,4)
// UEP5<EP5INEN>
extern volatile __bit                   EP5INEN             __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 EP5INEN_bit         _BIT_ACCESS(UEP5,1)
// UEP5<EP5OUTEN>
extern volatile __bit                   EP5OUTEN            __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 EP5OUTEN_bit        _BIT_ACCESS(UEP5,2)
// UEP5<EP5STALL>
extern volatile __bit                   EP5STALL            __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 EP5STALL_bit        _BIT_ACCESS(UEP5,0)
// UEP6<EP6CONDIS>
extern volatile __bit                   EP6CONDIS           __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 EP6CONDIS_bit       _BIT_ACCESS(UEP6,3)
// UEP6<EP6HSHK>
extern volatile __bit                   EP6HSHK             __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 EP6HSHK_bit         _BIT_ACCESS(UEP6,4)
// UEP6<EP6INEN>
extern volatile __bit                   EP6INEN             __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 EP6INEN_bit         _BIT_ACCESS(UEP6,1)
// UEP6<EP6OUTEN>
extern volatile __bit                   EP6OUTEN            __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 EP6OUTEN_bit        _BIT_ACCESS(UEP6,2)
// UEP6<EP6STALL>
extern volatile __bit                   EP6STALL            __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 EP6STALL_bit        _BIT_ACCESS(UEP6,0)
// UEP7<EP7CONDIS>
extern volatile __bit                   EP7CONDIS           __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 EP7CONDIS_bit       _BIT_ACCESS(UEP7,3)
// UEP7<EP7HSHK>
extern volatile __bit                   EP7HSHK             __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 EP7HSHK_bit         _BIT_ACCESS(UEP7,4)
// UEP7<EP7INEN>
extern volatile __bit                   EP7INEN             __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 EP7INEN_bit         _BIT_ACCESS(UEP7,1)
// UEP7<EP7OUTEN>
extern volatile __bit                   EP7OUTEN            __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 EP7OUTEN_bit        _BIT_ACCESS(UEP7,2)
// UEP7<EP7STALL>
extern volatile __bit                   EP7STALL            __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 EP7STALL_bit        _BIT_ACCESS(UEP7,0)
// UEP0<EPCONDIS0>
extern volatile __bit                   EPCONDIS0           __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 EPCONDIS0_bit       _BIT_ACCESS(UEP0,3)
// UEP1<EPCONDIS1>
extern volatile __bit                   EPCONDIS1           __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 EPCONDIS1_bit       _BIT_ACCESS(UEP1,3)
// UEP10<EPCONDIS10>
extern volatile __bit                   EPCONDIS10          __at(0x7BD3);	// @ (0xF7A * 8 + 3)
#define                                 EPCONDIS10_bit      _BIT_ACCESS(UEP10,3)
// UEP11<EPCONDIS11>
extern volatile __bit                   EPCONDIS11          __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 EPCONDIS11_bit      _BIT_ACCESS(UEP11,3)
// UEP12<EPCONDIS12>
extern volatile __bit                   EPCONDIS12          __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 EPCONDIS12_bit      _BIT_ACCESS(UEP12,3)
// UEP13<EPCONDIS13>
extern volatile __bit                   EPCONDIS13          __at(0x7BEB);	// @ (0xF7D * 8 + 3)
#define                                 EPCONDIS13_bit      _BIT_ACCESS(UEP13,3)
// UEP14<EPCONDIS14>
extern volatile __bit                   EPCONDIS14          __at(0x7BF3);	// @ (0xF7E * 8 + 3)
#define                                 EPCONDIS14_bit      _BIT_ACCESS(UEP14,3)
// UEP15<EPCONDIS15>
extern volatile __bit                   EPCONDIS15          __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 EPCONDIS15_bit      _BIT_ACCESS(UEP15,3)
// UEP2<EPCONDIS2>
extern volatile __bit                   EPCONDIS2           __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 EPCONDIS2_bit       _BIT_ACCESS(UEP2,3)
// UEP3<EPCONDIS3>
extern volatile __bit                   EPCONDIS3           __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 EPCONDIS3_bit       _BIT_ACCESS(UEP3,3)
// UEP4<EPCONDIS4>
extern volatile __bit                   EPCONDIS4           __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 EPCONDIS4_bit       _BIT_ACCESS(UEP4,3)
// UEP5<EPCONDIS5>
extern volatile __bit                   EPCONDIS5           __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 EPCONDIS5_bit       _BIT_ACCESS(UEP5,3)
// UEP6<EPCONDIS6>
extern volatile __bit                   EPCONDIS6           __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 EPCONDIS6_bit       _BIT_ACCESS(UEP6,3)
// UEP7<EPCONDIS7>
extern volatile __bit                   EPCONDIS7           __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 EPCONDIS7_bit       _BIT_ACCESS(UEP7,3)
// UEP8<EPCONDIS8>
extern volatile __bit                   EPCONDIS8           __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 EPCONDIS8_bit       _BIT_ACCESS(UEP8,3)
// UEP9<EPCONDIS9>
extern volatile __bit                   EPCONDIS9           __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 EPCONDIS9_bit       _BIT_ACCESS(UEP9,3)
// UEP0<EPHSHK0>
extern volatile __bit                   EPHSHK0             __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 EPHSHK0_bit         _BIT_ACCESS(UEP0,4)
// UEP1<EPHSHK1>
extern volatile __bit                   EPHSHK1             __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 EPHSHK1_bit         _BIT_ACCESS(UEP1,4)
// UEP10<EPHSHK10>
extern volatile __bit                   EPHSHK10            __at(0x7BD4);	// @ (0xF7A * 8 + 4)
#define                                 EPHSHK10_bit        _BIT_ACCESS(UEP10,4)
// UEP11<EPHSHK11>
extern volatile __bit                   EPHSHK11            __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 EPHSHK11_bit        _BIT_ACCESS(UEP11,4)
// UEP12<EPHSHK12>
extern volatile __bit                   EPHSHK12            __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 EPHSHK12_bit        _BIT_ACCESS(UEP12,4)
// UEP13<EPHSHK13>
extern volatile __bit                   EPHSHK13            __at(0x7BEC);	// @ (0xF7D * 8 + 4)
#define                                 EPHSHK13_bit        _BIT_ACCESS(UEP13,4)
// UEP14<EPHSHK14>
extern volatile __bit                   EPHSHK14            __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 EPHSHK14_bit        _BIT_ACCESS(UEP14,4)
// UEP15<EPHSHK15>
extern volatile __bit                   EPHSHK15            __at(0x7BFC);	// @ (0xF7F * 8 + 4)
#define                                 EPHSHK15_bit        _BIT_ACCESS(UEP15,4)
// UEP2<EPHSHK2>
extern volatile __bit                   EPHSHK2             __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 EPHSHK2_bit         _BIT_ACCESS(UEP2,4)
// UEP3<EPHSHK3>
extern volatile __bit                   EPHSHK3             __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 EPHSHK3_bit         _BIT_ACCESS(UEP3,4)
// UEP4<EPHSHK4>
extern volatile __bit                   EPHSHK4             __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 EPHSHK4_bit         _BIT_ACCESS(UEP4,4)
// UEP5<EPHSHK5>
extern volatile __bit                   EPHSHK5             __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 EPHSHK5_bit         _BIT_ACCESS(UEP5,4)
// UEP6<EPHSHK6>
extern volatile __bit                   EPHSHK6             __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 EPHSHK6_bit         _BIT_ACCESS(UEP6,4)
// UEP7<EPHSHK7>
extern volatile __bit                   EPHSHK7             __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 EPHSHK7_bit         _BIT_ACCESS(UEP7,4)
// UEP8<EPHSHK8>
extern volatile __bit                   EPHSHK8             __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 EPHSHK8_bit         _BIT_ACCESS(UEP8,4)
// UEP9<EPHSHK9>
extern volatile __bit                   EPHSHK9             __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 EPHSHK9_bit         _BIT_ACCESS(UEP9,4)
// UEP0<EPINEN0>
extern volatile __bit                   EPINEN0             __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 EPINEN0_bit         _BIT_ACCESS(UEP0,1)
// UEP1<EPINEN1>
extern volatile __bit                   EPINEN1             __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 EPINEN1_bit         _BIT_ACCESS(UEP1,1)
// UEP10<EPINEN10>
extern volatile __bit                   EPINEN10            __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 EPINEN10_bit        _BIT_ACCESS(UEP10,1)
// UEP11<EPINEN11>
extern volatile __bit                   EPINEN11            __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 EPINEN11_bit        _BIT_ACCESS(UEP11,1)
// UEP12<EPINEN12>
extern volatile __bit                   EPINEN12            __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 EPINEN12_bit        _BIT_ACCESS(UEP12,1)
// UEP13<EPINEN13>
extern volatile __bit                   EPINEN13            __at(0x7BE9);	// @ (0xF7D * 8 + 1)
#define                                 EPINEN13_bit        _BIT_ACCESS(UEP13,1)
// UEP14<EPINEN14>
extern volatile __bit                   EPINEN14            __at(0x7BF1);	// @ (0xF7E * 8 + 1)
#define                                 EPINEN14_bit        _BIT_ACCESS(UEP14,1)
// UEP15<EPINEN15>
extern volatile __bit                   EPINEN15            __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 EPINEN15_bit        _BIT_ACCESS(UEP15,1)
// UEP2<EPINEN2>
extern volatile __bit                   EPINEN2             __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 EPINEN2_bit         _BIT_ACCESS(UEP2,1)
// UEP3<EPINEN3>
extern volatile __bit                   EPINEN3             __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 EPINEN3_bit         _BIT_ACCESS(UEP3,1)
// UEP4<EPINEN4>
extern volatile __bit                   EPINEN4             __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 EPINEN4_bit         _BIT_ACCESS(UEP4,1)
// UEP5<EPINEN5>
extern volatile __bit                   EPINEN5             __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 EPINEN5_bit         _BIT_ACCESS(UEP5,1)
// UEP6<EPINEN6>
extern volatile __bit                   EPINEN6             __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 EPINEN6_bit         _BIT_ACCESS(UEP6,1)
// UEP7<EPINEN7>
extern volatile __bit                   EPINEN7             __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 EPINEN7_bit         _BIT_ACCESS(UEP7,1)
// UEP8<EPINEN8>
extern volatile __bit                   EPINEN8             __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 EPINEN8_bit         _BIT_ACCESS(UEP8,1)
// UEP9<EPINEN9>
extern volatile __bit                   EPINEN9             __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 EPINEN9_bit         _BIT_ACCESS(UEP9,1)
// UEP0<EPOUTEN0>
extern volatile __bit                   EPOUTEN0            __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 EPOUTEN0_bit        _BIT_ACCESS(UEP0,2)
// UEP1<EPOUTEN1>
extern volatile __bit                   EPOUTEN1            __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 EPOUTEN1_bit        _BIT_ACCESS(UEP1,2)
// UEP10<EPOUTEN10>
extern volatile __bit                   EPOUTEN10           __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 EPOUTEN10_bit       _BIT_ACCESS(UEP10,2)
// UEP11<EPOUTEN11>
extern volatile __bit                   EPOUTEN11           __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 EPOUTEN11_bit       _BIT_ACCESS(UEP11,2)
// UEP12<EPOUTEN12>
extern volatile __bit                   EPOUTEN12           __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 EPOUTEN12_bit       _BIT_ACCESS(UEP12,2)
// UEP13<EPOUTEN13>
extern volatile __bit                   EPOUTEN13           __at(0x7BEA);	// @ (0xF7D * 8 + 2)
#define                                 EPOUTEN13_bit       _BIT_ACCESS(UEP13,2)
// UEP14<EPOUTEN14>
extern volatile __bit                   EPOUTEN14           __at(0x7BF2);	// @ (0xF7E * 8 + 2)
#define                                 EPOUTEN14_bit       _BIT_ACCESS(UEP14,2)
// UEP15<EPOUTEN15>
extern volatile __bit                   EPOUTEN15           __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 EPOUTEN15_bit       _BIT_ACCESS(UEP15,2)
// UEP2<EPOUTEN2>
extern volatile __bit                   EPOUTEN2            __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 EPOUTEN2_bit        _BIT_ACCESS(UEP2,2)
// UEP3<EPOUTEN3>
extern volatile __bit                   EPOUTEN3            __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 EPOUTEN3_bit        _BIT_ACCESS(UEP3,2)
// UEP4<EPOUTEN4>
extern volatile __bit                   EPOUTEN4            __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 EPOUTEN4_bit        _BIT_ACCESS(UEP4,2)
// UEP5<EPOUTEN5>
extern volatile __bit                   EPOUTEN5            __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 EPOUTEN5_bit        _BIT_ACCESS(UEP5,2)
// UEP6<EPOUTEN6>
extern volatile __bit                   EPOUTEN6            __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 EPOUTEN6_bit        _BIT_ACCESS(UEP6,2)
// UEP7<EPOUTEN7>
extern volatile __bit                   EPOUTEN7            __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 EPOUTEN7_bit        _BIT_ACCESS(UEP7,2)
// UEP8<EPOUTEN8>
extern volatile __bit                   EPOUTEN8            __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 EPOUTEN8_bit        _BIT_ACCESS(UEP8,2)
// UEP9<EPOUTEN9>
extern volatile __bit                   EPOUTEN9            __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 EPOUTEN9_bit        _BIT_ACCESS(UEP9,2)
// UEP0<EPSTALL0>
extern volatile __bit                   EPSTALL0            __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 EPSTALL0_bit        _BIT_ACCESS(UEP0,0)
// UEP1<EPSTALL1>
extern volatile __bit                   EPSTALL1            __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 EPSTALL1_bit        _BIT_ACCESS(UEP1,0)
// UEP10<EPSTALL10>
extern volatile __bit                   EPSTALL10           __at(0x7BD0);	// @ (0xF7A * 8 + 0)
#define                                 EPSTALL10_bit       _BIT_ACCESS(UEP10,0)
// UEP11<EPSTALL11>
extern volatile __bit                   EPSTALL11           __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 EPSTALL11_bit       _BIT_ACCESS(UEP11,0)
// UEP12<EPSTALL12>
extern volatile __bit                   EPSTALL12           __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 EPSTALL12_bit       _BIT_ACCESS(UEP12,0)
// UEP13<EPSTALL13>
extern volatile __bit                   EPSTALL13           __at(0x7BE8);	// @ (0xF7D * 8 + 0)
#define                                 EPSTALL13_bit       _BIT_ACCESS(UEP13,0)
// UEP14<EPSTALL14>
extern volatile __bit                   EPSTALL14           __at(0x7BF0);	// @ (0xF7E * 8 + 0)
#define                                 EPSTALL14_bit       _BIT_ACCESS(UEP14,0)
// UEP15<EPSTALL15>
extern volatile __bit                   EPSTALL15           __at(0x7BF8);	// @ (0xF7F * 8 + 0)
#define                                 EPSTALL15_bit       _BIT_ACCESS(UEP15,0)
// UEP2<EPSTALL2>
extern volatile __bit                   EPSTALL2            __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 EPSTALL2_bit        _BIT_ACCESS(UEP2,0)
// UEP3<EPSTALL3>
extern volatile __bit                   EPSTALL3            __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 EPSTALL3_bit        _BIT_ACCESS(UEP3,0)
// UEP4<EPSTALL4>
extern volatile __bit                   EPSTALL4            __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 EPSTALL4_bit        _BIT_ACCESS(UEP4,0)
// UEP5<EPSTALL5>
extern volatile __bit                   EPSTALL5            __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 EPSTALL5_bit        _BIT_ACCESS(UEP5,0)
// UEP6<EPSTALL6>
extern volatile __bit                   EPSTALL6            __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 EPSTALL6_bit        _BIT_ACCESS(UEP6,0)
// UEP7<EPSTALL7>
extern volatile __bit                   EPSTALL7            __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 EPSTALL7_bit        _BIT_ACCESS(UEP7,0)
// UEP8<EPSTALL8>
extern volatile __bit                   EPSTALL8            __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 EPSTALL8_bit        _BIT_ACCESS(UEP8,0)
// UEP9<EPSTALL9>
extern volatile __bit                   EPSTALL9            __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 EPSTALL9_bit        _BIT_ACCESS(UEP9,0)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// EECON1<FREE>
extern volatile __bit                   FREE                __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON1,4)
// UFRML<FRM0>
extern volatile __bit                   FRM0                __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 FRM0_bit            _BIT_ACCESS(UFRML,0)
// UFRML<FRM1>
extern volatile __bit                   FRM1                __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 FRM1_bit            _BIT_ACCESS(UFRML,1)
// UFRMH<FRM10>
extern volatile __bit                   FRM10               __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 FRM10_bit           _BIT_ACCESS(UFRMH,2)
// UFRML<FRM2>
extern volatile __bit                   FRM2                __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 FRM2_bit            _BIT_ACCESS(UFRML,2)
// UFRML<FRM3>
extern volatile __bit                   FRM3                __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 FRM3_bit            _BIT_ACCESS(UFRML,3)
// UFRML<FRM4>
extern volatile __bit                   FRM4                __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 FRM4_bit            _BIT_ACCESS(UFRML,4)
// UFRML<FRM5>
extern volatile __bit                   FRM5                __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 FRM5_bit            _BIT_ACCESS(UFRML,5)
// UFRML<FRM6>
extern volatile __bit                   FRM6                __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 FRM6_bit            _BIT_ACCESS(UFRML,6)
// UFRML<FRM7>
extern volatile __bit                   FRM7                __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 FRM7_bit            _BIT_ACCESS(UFRML,7)
// UFRMH<FRM8>
extern volatile __bit                   FRM8                __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 FRM8_bit            _BIT_ACCESS(UFRMH,0)
// UFRMH<FRM9>
extern volatile __bit                   FRM9                __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 FRM9_bit            _BIT_ACCESS(UFRMH,1)
// UCFG<FSEN>
extern volatile __bit                   FSEN                __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 FSEN_bit            _BIT_ACCESS(UCFG,2)
// INTCON<GIE>
